espkvm/microlink/examples/eth_connect/sdkconfig.defaults
# MicroLink over Ethernet — ESP32-P4 (Waveshare)
CONFIG_IDF_TARGET="esp32p4"

# This targets the original Waveshare ESP32-P4 module (silicon rev v1.x); the
# IDF 6 default min-rev is v3.0, which refuses to boot on it. Rev <3.0 support is
# gated behind SELECTS_REV_LESS_V3, and only then is REV_MIN_100 selectable.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# Rev <3.0 silicon tops out at 360 MHz; the IDF 6 default 400 MHz makes
# esp_clk_init() assert on this board (boot loop).
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# 32 MB HEX PSRAM (MicroLink allocates large buffers there)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y

# Ethernet: internal EMAC
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_ETH_PHY_INTERFACE_RMII=y

# wireguard_lwip does a raw lwIP netif_add; on IDF6 esp_netif otherwise reads a
# garbage handle out of netif->state and crashes. The bridge layout keeps
# esp_netif's per-netif data in its own slot.
CONFIG_ESP_NETIF_BRIDGE_EN=y

# mbedTLS: the coord/DERP TLS clients skip cert validation (Noise authenticates
# the control plane), so no cert bundle is needed here.
# ChaCha20-Poly1305 for the Noise layer (ml_noise.c). On WiFi SoCs the supplicant
# pulls these in transitively; the P4 has no WiFi, so enable them explicitly.
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_POLY1305_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
